from app.models.models_DB import Faculty

Faculty.create('Авиастроение', None, ['227'], ['228'], None). \
    add_dean('Зимонов', 'Олег', 'Владимирович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Агропромышленный', None, ['327б'], ['327в'], None). \
    add_dean('Рудой', 'Дмитрий', 'Владимирович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Автоматизация, мехатроника и управление', 'АМиУ', ['280'], ['281', '279'], None). \
    add_dean('Обухов', 'Павел', 'Серафимович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Безопасносить жизнедеятельности и инженерная экология', 'БЖиИЭ', ['210'], None, None). \
    add_dean('Хлебунов', 'Сергей', 'Анатольевич'). \
    add_schedule('пн', '8:30', '16:00'). \
    add_schedule('вт', '8:30', '16:00'). \
    add_schedule('ср', '8:30', '16:00'). \
    add_schedule('чт', '8:30', '16:00'). \
    add_schedule('пт', '8:30', '16:00'). \
    add_schedule('сб', '8:30', '16:00')

Faculty.create('Дорожно-транспортный', 'ДТ', ['26-704'], ['26-702'], None). \
    add_dean('Топилин', 'Иван', 'Владимирович'). \
    add_schedule('пн', '8:30', '16:30'). \
    add_schedule('вт', '8:30', '16:30'). \
    add_schedule('ср', '8:30', '16:30'). \
    add_schedule('чт', '8:30', '16:30'). \
    add_schedule('пт', '8:30', '16:30'). \
    add_schedule('сб', '8:30', '13:00')

Faculty.create('Инженерно-строительный', 'ИТ', ['22-506'], None, None). \
    add_dean('Явруян', 'Хунгианос', 'Степанович'). \
    add_schedule('пн', '8:30', '16:00'). \
    add_schedule('вт', '8:30', '16:00'). \
    add_schedule('ср', '8:30', '16:00'). \
    add_schedule('чт', '8:30', '16:00'). \
    add_schedule('пт', '8:30', '16:00'). \
    add_schedule('сб', '8:30', '13:00')

Faculty.create('Инновационный бизнес и менеджмент', 'ИБиМ', ['408'], ['409'], None). \
    add_dean('Осадчая', 'Наталья', 'Алексеевна'). \
    add_schedule('пн', '8:30', '16:00'). \
    add_schedule('вт', '8:30', '16:00'). \
    add_schedule('ср', '8:30', '16:00'). \
    add_schedule('чт', '8:30', '16:00'). \
    add_schedule('пт', '8:30', '16:00'). \
    add_schedule('сб', '8:30', '14:00')

Faculty.create('Институт опережающих технологий "Школа Икс"', 'ИОТ', ['100'], None, None). \
    add_dean('Герасин', 'Павел', 'Владимирович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Институт физической культуры и спорта', 'ИФКиС', ['104'], ['105'], None). \
    add_dean('Мавропуло', 'Ольга', 'Сергеевна'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Информатика и вычислительная техника', 'ИиВТ', ['346'], ['309'], None). \
    add_dean('Поркшеян', 'Виталий', 'Маркосович'). \
    add_schedule('пн', '8:30', '17:30'). \
    add_schedule('вт', '8:30', '17:30'). \
    add_schedule('ср', '8:30', '17:30'). \
    add_schedule('чт', '8:30', '17:30'). \
    add_schedule('пт', '8:30', '17:30'). \
    add_schedule('сб', '8:30', '14:00')

Faculty.create('Информационно-экономические системы', 'ИЭС', ['22-506'], None, None). \
    add_dean('Еременко', 'Игорь', 'Анатольевич'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Машиностроительные технологии и оборудование', 'МТиО', ['277'], ['278'], None). \
    add_dean('Кочетов', 'Андрей', 'Николаевич'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Медиакоммуникации и мультимедийные технологии', 'МКиМТ', ['806'], None, None). \
    add_dean('Дуборев', 'Денис', 'Анатольевич'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Международный', None, ['548'], None, None). \
    add_dean('Проскурин', 'Евгений', 'Геннадьевич'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Приборостроение и техническое регулирование', 'ПиТР', ['455а'], ['457'], None). \
    add_dean('Чаава', 'Михаил', 'Мигонович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Психология, педагогика и дефектология', 'ППиД', ['307'], ['306'], None). \
    add_dean('Абакумова', 'Ирина', 'Владимировна'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '14:00')

Faculty.create('Сервис и туризм', 'СиТ', ['17-202'], None, None). \
    add_dean('Минасян', 'Лариса', 'Артаваздовна'). \
    add_schedule('пн', '8:30', '16:00'). \
    add_schedule('вт', '8:30', '16:00'). \
    add_schedule('ср', '8:30', '16:00'). \
    add_schedule('чт', '8:30', '16:00'). \
    add_schedule('пт', '8:30', '16:00'). \
    add_schedule('сб', '8:30', '14:00')

Faculty.create('Социально-гуманитарный', 'СГ', ['332'], ['333'], None). \
    add_dean('Мамчиц', 'Наталья', 'Александровна'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Технология машиностроения', 'ТМ', ['548'], None, None). \
    add_dean('Вовченко', 'Сергей', 'Владимирович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Транспорт сервис и туризм', 'ТСиТ', ['17-218'], ['17-220'], None). \
    add_dean('Попов', 'Сергей', 'Иванович'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00')

Faculty.create('Школа архитектуры, дизайна и искусств', 'ШАДиИ', ['201'], ['203'], None). \
    add_dean('Евенко', 'Максим', 'Григорьевич'). \
    add_schedule('пн', '8:30', '17:00'). \
    add_schedule('вт', '8:30', '17:00'). \
    add_schedule('ср', '8:30', '17:00'). \
    add_schedule('чт', '8:30', '17:00'). \
    add_schedule('пт', '8:30', '17:00'). \
    add_schedule('сб', '8:30', '14:00')

Faculty.create('Энергетика и нефтегазопромышленность', 'ЭиН', ['217'], ['219'], None). \
    add_dean('Гапонов', 'Владимир', 'Лавреньтевич'). \
    add_schedule('пн', '8:30', '16:00'). \
    add_schedule('вт', '8:30', '16:00'). \
    add_schedule('ср', '8:30', '16:00'). \
    add_schedule('чт', '8:30', '16:00'). \
    add_schedule('пт', '8:30', '16:00'). \
    add_schedule('сб', '8:30', '14:00')

Faculty.create('Юридический', None, ['405'], None, None). \
    add_dean('Исакова', 'Юлия', 'Игоревна'). \
    add_schedule('пн', '8:30', '16:00'). \
    add_schedule('вт', '8:30', '16:00'). \
    add_schedule('ср', '8:30', '16:00'). \
    add_schedule('чт', '8:30', '16:00'). \
    add_schedule('пт', '8:30', '16:00'). \
    add_schedule('сб', '8:30', '14:00')
